<a href="https://colab.research.google.com/github/CharlesPrado23/Bootcamp2oSemestre2021/blob/main/Semana5/Semana5(SQL)_Aula.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3
engine = sqlite3.connect('sql.db')

In [ ]:
cursor = engine.cursor()

cursor.execute("PRAGMA foreign_keys = ON").fetchall()

### cursor.execute("PRAGMA foreign_keys").fetchall()

[]

### Syntax:
### "CREATE [TEMP | TEMPORARY] TABLE table-name (
### column-def[, column-def]
### [,constraint]);

### column-def:
### name [type] [[CONSTRAINT name] column-constraint]"

In [ ]:
sql_create_projects_table = 'CREATE TABLE IF NOT EXISTS projects (\
                                        id integer PRIMARY KEY,\
                                        name text NOT NULL,\
                                        begin_date text,\
                                        end_date text\
                                    )'

In [ ]:
sql_create_tasks_table = """CREATE TABLE IF NOT EXISTS tasks (
                                    id integer PRIMARY KEY,
                                    name text NOT NULL,
                                    priority integer,
                                    status_id integer NOT NULL,
                                    project_id integer NOT NULL REFERENCES projects (id),
                                    begin_date text NOT NULL,
                                    end_date text NOT NULL
                                );"""
# StudentId INT REFERENCES Student (StudentId)
#FOREIGN KEY (project_id) REFERENCES projects (id)

In [ ]:
### Command execute #####
cursor.execute(sql_create_projects_table)

In [ ]:
#### Commit #####
engine.commit()

In [ ]:
cursor.execute('PRAGMA table_info(projects)').fetchall()

[(0, 'id', 'integer', 0, None, 1),
 (1, 'name', 'text', 1, None, 0),
 (2, 'begin_date', 'text', 0, None, 0),
 (3, 'end_date', 'text', 0, None, 0)]

In [ ]:
data = cursor.execute('PRAGMA table_info(projects)').fetchall()
type(data[0])
for d in data:
  print(d[0],d[1],d[2])

0 id integer
1 name text
2 begin_date text
3 end_date text

In [ ]:
cursor.execute(sql_create_tasks_table)

In [ ]:
#### Types de cada atributo da Tabela ####### 
#### Comando PRAGMA table_info("Nome da tabela") 
sql_info = 'PRAGMA table_info(tasks)'
data = cursor.execute(sql_info).fetchall()
for d in data:
  print(d[0],d[1],d[2])

0 id integer
1 name text
2 priority integer
3 status_id integer
4 project_id integer
5 begin_date text
6 end_date text

## SYNTAX (INSERT): 

### "INSERT [OR conflict-algorithm]
### INTO [database-name .] table-name [(column-list)]
### VALUES (value-list)"

In [ ]:
### Comando Insert ##### 
### INSERT INTO table VALUES () 
### INSERT INTO table (columns) VALUES ()

In [ ]:
sql_insert = 'INSERT INTO projects VALUES(20,"PROJETO_01","2021-07-18"," ")'
cursor.execute(sql_insert)

In [ ]:
engine.commit()

In [ ]:
sql_insert2 = 'INSERT INTO projects (name,begin_date,end_date) VALUES("PROJETO_02"," ", " ")'
cursor.execute(sql_insert2)
engine.commit()

In [ ]:
sql_insert3 = 'INSERT INTO projects (name) VALUES("PROJETO_03")'
cursor.execute(sql_insert3)
engine.commit()

In [ ]:
 #### Comando SELECT #####
 ###. SELECT * FROM table #####
data = cursor.execute('SELECT * FROM projects ').fetchall()
for row in data: 
  print(row)

(20, 'PROJETO_01', '2021-07-18', ' ')
(21, 'PROJETO_02', ' ', ' ')
(22, 'PROJETO_03', None, None)

In [ ]:
### INSERT values into Task ###### 
sql_insert3 = 'INSERT INTO tasks VALUES(200,"tarefa_01",0,20,22,"","")'
cursor.execute(sql_insert3)
engine.commit()

In [ ]:
### LER os valores inseridos #######
cursor.execute('SELECT * FROM tasks').fetchall()

[(100, 'tarefa_01', 0, 20, 22, '', ''), (200, 'tarefa_01', 0, 20, 22, '', '')]

## SYNTAX (SELECT): 

### SELECT [ALL | DISTINCT] result [FROM table-list]
### [WHERE expr]
### [GROUP BY expr-list]
### [HAVING expr]
### [compound-op select]*
### [ORDER BY sort-expr-list]
### [LIMIT integer [(OFFSET|,) integer]]

In [ ]:
### CREATE TABLE EMP and DEPTO #######
cursor.execute('''CREATE TABLE IF NOT EXISTS EMP (EMPNO int, ENAME text, JOB text, MGR int, HIREDATE date, SAL real,COMM int, DEPTNO int)''')

In [ ]:
data = cursor.execute("PRAGMA table_info(EMP)").fetchall()
for d in data:
    print (d[0], d[1], d[2])

0 EMPNO int
1 ENAME text
2 JOB text
3 MGR int
4 HIREDATE date
5 SAL real
6 COMM int
7 DEPTNO int

In [ ]:
 employes = [(7369, 'SMITH',  'CLERK', 7902, '2005-12-11', 800, 150 , 20),
 (7499, 'ALLEN',  'SALESMAN', 7698, '2006-02-23',1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698,'2006-02-26', 1250, 500, 30),
 (7566, 'JONES','MANAGER', 7839,'2006-04-02', 2975, 520, 20),            
 (7654, 'MARTIN','SALESMAN', 7698,'2006-09-28', 1400, 420, 30),
 (7698, 'BLAKE','MANAGER', 7839,'2006-05-1', 2850, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09',2450, 580,10),
 (7788, 'SCOTT', 'ANALYST', 7566,'2007-12-09',3000,640,20),
 (7839, 'KING','PRESIDENT','', '2006-11-17',5000,0,10),
 (7844, 'TURNER', 'SALESMAN',7698,'2006-09-13',1500,0,30),
 (7876, 'ADAMS', 'CLERK',7788, '2008-01-12',1100,50,20),
 (7900, 'JAMES', 'CLERK',7698, '2006-12-03',950,40,30),
 (7902, 'FORD', 'ANALYST',7566,'2006-12-03',3000,10,20),
 (7934, 'MILLER','CLERK',7782,'2007-01-23',1300,"",10)]

In [ ]:
type(employes[0])

tuple

In [ ]:
cursor.executemany('INSERT INTO EMP VALUES (?,?,?,?,?,?,?,?)', employes)
engine.commit()

In [ ]:
#### READ THE CONTENTS OF EMP TABLE 
cursor.execute('SELECT * FROM EMP').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20),
 (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10)]

In [ ]:
cursor.execute('''CREATE TABLE IF NOT EXISTS DEPT
             (DEPTNO int not null, DNAME  text, LOC text)''')

In [ ]:
depts = [(10,'ACCOUNTING','NEW YORK'),
         (20,'RESEARCH','DALLAS'),
         (30,'SALES','CHICAGO'),
         (40,'OPERATIONS','BOSTON')]

In [ ]:
type(depts)

list

In [ ]:
cursor.executemany('INSERT INTO DEPT VALUES (?,?,?)', depts)

In [ ]:
cursor.execute('SELECT * FROM DEPT').fetchall()

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

In [ ]:
### SELECT - Filtrando por atributos (Colunas) ##### 

data = cursor.execute('select ename as NAME, job from emp').fetchall()
print(cursor.description[0][0],"     ",cursor.description[1][0])
#for x in cursor.description: 
#    print(x[0])
for row in data: 
  print(row)

NAME       JOB
('SMITH', 'CLERK')
('ALLEN', 'SALESMAN')
('WARD', 'SALESMAN')
('JONES', 'MANAGER')
('MARTIN', 'SALESMAN')
('BLAKE', 'MANAGER')
('CLARK', 'MANAGER')
('SCOTT', 'ANALYST')
('KING', 'PRESIDENT')
('TURNER', 'SALESMAN')
('ADAMS', 'CLERK')
('JAMES', 'CLERK')
('FORD', 'ANALYST')
('MILLER', 'CLERK')
('SMITH', 'CLERK')
('ALLEN', 'SALESMAN')
('WARD', 'SALESMAN')
('JONES', 'MANAGER')
('MARTIN', 'SALESMAN')
('BLAKE', 'MANAGER')
('CLARK', 'MANAGER')
('SCOTT', 'ANALYST')
('KING', 'PRESIDENT')
('TURNER', 'SALESMAN')
('ADAMS', 'CLERK')
('JAMES', 'CLERK')
('FORD', 'ANALYST')
('MILLER', 'CLERK')

In [ ]:
### Retrieving a Subset of Rows from a Table #### 
#### SELECT xxxx FROM TABLE Where clause ####

In [ ]:
### Ex 2 - Count ###3

In [ ]:
### Ex 3 - DISTINCT ###

### SYNTAX (UPDATE): 

### UPDATE table_name SET column_name=new_value [, ...] WHERE expression

In [ ]:
### Modificar salário ->. sal = 1.10*sal #####

In [ ]:
### Using Conditional Logic in a SELECT Statement ####

In [ ]:
### Miscelanous #### 
### Limiting the Number of Rows Returned ####

In [ ]:
### Returning Valores aleatórios #####

In [ ]:
## Searching for Patterns ####
## Ex1 - range

In [ ]:
## Searching for Patterns ####
## Ex2 - substring #####

In [ ]:
#### Order by ### 
### Ascendent ###

In [ ]:
#### Order by ### 
### Descendent ###

In [ ]:
#### Realizar alguns SELECTS ##### 
###  Por exemplo Location = New York 
#### ----- #####

In [ ]:
### Achar datas a partir de 2000 ###

In [ ]:
#### ORDER BY SUBSTRING ##### 
### substr( string, start, length ) ##### 

### length(str) - retorna o tamanho da string = número de caracteres
### length(Nicolly) = 7 ; lly - substring(Nicolly,5) = lly

In [ ]:
### selecionar nomes terminando com RK ou TH

In [ ]:
#### SELECT 
###. group by using native functions - COUNT and AVG
###  O que quero selecionar (atributos) 
### Por quem quero agrupar

### Quero obter o resultado abaixo, no entanto os atributos são de colunas diferentes

 
ENAME       LOC\
----------  ----------\
CLARK        NEW YORK\
KING         NEW YORK\
MILLER       NEW YORK

In [ ]:
### Selecionar todos os infos dos empregados e departamentos - mesmo departamentos_ID

In [ ]:
### Selecionar somente os Nomes dos empregados e os nomes dos departamentos